Repository: catman0745/Catman.Education
Catalog: Catman.Education.Localization/Localizer.*.resx
Languages: ru

# Group with id retrieved
source: Group with id "{id}" retrieved successfully
ru: Получена группа с id "{id}"

# Groups retrieved
source: Several ({count}) groups retrieved successfully
ru: Получено несколько ({count}) групп

# Group with id not found
source: Group with id "{id}" not found
ru: Группа с id "{id}" не найдена

source: Must be unique
ru: Должен быть уникален

# Group with id created
source: Group with id "{id}" created successfully
ru: Создана группа с id "{id}"

# Group with id removed
source: Group with id "{id}" removed successfully
ru: Группа с id "{id}" удалена

# Group with id updated
source: Group with id "{id}" updated successfully
ru: Группа с id "{id}" обновлена

# User with id not found
source: User with id "{id}" not found
ru: Пользователь с id "{id}" не найден

# User with id removed
source: User with id "{id}" removed successfully
ru: Пользователь с id "{id}" удалён

# User with username not found
source: User "{username}" not found
ru: Пользователь "{username}" не найден

source: Incorrect password
ru: Неверный пароль

# Token for user with username generated
source: Token for user "{username}" generated successfully
ru: Сгенерирован токен для пользователя "{username}"

# User with id retrieved
source: User with id "{id}" retrieved successfully
ru: Получен пользователь с id "{id}"

# Users retrieved
source: Several ({count}) users retrieved successfully
ru: Получено несколько ({count}) пользователей

# Admin with id registered
source: Admin with id "{id}" registered successfully
ru: Зарегистрирован админ с id "{id}"

# Admin with id not found
source: Admin with id "{id}" not found
ru: Админ с id "{id}" не найден

# Admin with id updated
source: Admin with id "{id}" updated successfully
ru: Админ с id "{id}" обновлён

# Admins retrieved
source: Several ({count}) admins retrieved successfully
ru: Получено несколько ({count}) админов

# Discipline with id created
source: Discipline with id "{id}" created successfully
ru: Создана дисциплина с id "{id}"

# Discipline with id not found
source: Discipline with id "{id}" not found
ru: Дисциплина с id "{id}" не найдена

# Discipline with id removed
source: Discipline with id "{id}" removed successfully
ru: Дисциплина с id "{id}" удалена

# Discipline with id updated
source: Discipline with id "{id}" updated successfully
ru: Дисциплина с id "{id}" обновлена

# Discipline with id retrieved
source: Discipline with id "{id}" retrieved successfully
ru: Получена дисциплина с id "{id}"

# Disciplines retrieved
source: Several ({count}) disciplines retrieved successfully
ru: Получено несколько ({count}) дисциплин

# Student with id registered
source: Student with id "{id}" registered successfully
ru: Зарегистрирован студент с id "{id}"

# Student with id not found
source: Student with id "{id}" not found
ru: Студент с id "{id}" не найден

# Student with id updated
source: Student with id "{id}" updated successfully
ru: Студент с id "{id}" обновлён

# Student with id retrieved
source: Student with id "{id}" retrieved successfully
ru: Получен студент с id "{id}"

# Students retrieved
source: Several ({count}) students retrieved successfully
ru: Получено несколько ({count}) студентов

# Test with id created
source: Test with id "{id}" created successfully
ru: Создан тест с id "{id}"

# Test with id not found
source: Test with id "{id}" not found
ru: Тест с id "{id}" не найден

# Test with id removed
source: Test with id "{id}" removed successfully
ru: Тест с id "{id}" удалён

# Test with id updated
source: Test with id "{id}" updated successfully
ru: Тест с id "{id}" обновлён

# Test with id retrieved
source: Test with id "{id}" retrieved successfully
ru: Получен тест с id "{id}"

# Tests retrieved
source: Several ({count}) tests retrieved successfully
ru: Получено несколько ({count}) тестов

# Question with id created
source: Question with id "{id}" created successfully
ru: Создан вопрос с id "{id}"

# Question with id not found
source: Question with id "{id}" not found
ru: Вопрос с id "{id}" не найден

# Question with id removed
source: Question with id "{id}" removed successfully
ru: Вопрос с id "{id}" удалён

# Question with id updated
source: Question with id "{id}" updated successfully
ru: Вопрос с id "{id}" обновлён

# Question with id retrieved
source: Question with id "{id}" retrieved successfully
ru: Получен вопрос с id "{id}"

# Questions retrieved
source: Several ({count}) questions retrieved
ru: Получено несколько ({count}) вопросов

# Validation error
source: Validation errors occured
ru: На этапе валидации возникли ошибки

# Unauthorized error
source: User must be authorized
ru: Пользователь должен быть авторизован

# Access violation error
source: Access violation
ru: Нарушение прав доступа

# Access violation role error
source: Access violation: user must be {role}
ru: Нарушение прав доступа: пользователь должен иметь роль "{role}"

# Username regex validation error message
source: {PropertyName} must consist of Latin letters, digits and underscores
ru: {PropertyName} должен содердать только буквы Латинского алфавита, цифры и знаки подчёркивания

# Not empty validation error
source: {PropertyName} required
ru: Поле "{PropertyName}" обязательно

# Max length validation error
source: {PropertyName} must not exceed {MaxLength} characters
ru: Поле "{PropertyName}" должно быть не длиннее {MaxLength} символов

# Inclusive between validation error
source: {PropertyName} must be between {From} and {To}
ru: Значение поля "{PropertyName}" должно быть между {From} и {To}

# Greater than or equal to validation error
source: {PropertyName} must be greater than or equal to {ComparisonValue}
ru: Значение поля "{PropertyName}" должно быть больше или равно {ComparisonValue}

# Not null validation error
source: {PropertyName} must not be null
ru: Значение поля "{PropertyName}" не должно быть null

# Test with id checked
source: Test with id "{id}" checked successfully
ru: Тест с id "{id}" проверен

# Test with id already passed by student with id
source: Student with id "{studentId}" already passed test with id "{testId}"
ru: Студент с id "{studentId}" уже прошёл тест с id "{testId}"

# Testing results retrieved
source: Several ({count}) testing results retrieved successfully
ru: Получено несколько ({count}) результатов тестирования

# Testing result with testId and studentId retrieved
source: The result of passing the test with the id "{testId}" by the student with the id "{studentId}" retrieved successfully
ru: Получен результат прохождения теста с id "{testId}" студентом с id "{studentId}"

# Testing result with testId and studentId not found
source: The result of passing the test with the id "{testId}" by the student with the id "{studentId}" not found
ru: Результат прохождения теста с id "{testId}" студентом с id "{studentId}" не найден
